t1 = [1,1]
t2 = [1,3]
t3 = [4,1]
if (t1[0] == t2[0] or t1[0] == t3[0] or t2[0]  == t3[0]) and (t1[1] == t2[1] or t1[1] == t3[1] or t2[1]  == t3[1]):
    if(t1[0] == t2[0] and t1[0] == t3[0] and t2[0] == t3[0]) or (t1[1] == t2[1] and t1[1] == t3[1] and t2[1] == t3[1]):
        print("это не треугольник а херня какая-то")
    else:
        if t1 == t2 or t1 == t3 or t2 == t3:
            print("это не треугольник а херня какая-то")
        else:
            print("Прямоугольный треугольник")
else:
    print("непрямоугольный")